In [2]:
import pandas as pd


# create practice dictionary

pract = {'name' : ["John","Jacob","Jingle","Heimer","Schmidt","Polly","Pattern"],
         'age' : [22,33,44,45,52,36,7],
         'grade' : [99,98,91,87,83,99,7],
         'gender' : ["M","M","M","M","M","F","M"]}

In [3]:
df1 = pd.DataFrame(pract)

In [4]:
df1.head()

      name  age  grade gender
0     John   22     99      M
1    Jacob   33     98      M
2   Jingle   44     91      M
3   Heimer   45     87      M
4  Schmidt   52     83      M

In [5]:
#Display top 3 rows of a dataset
df1.head(3)

     name  age  grade gender
0    John   22     99      M
1   Jacob   33     98      M
2  Jingle   44     91      M

In [6]:
#Display last 3 rows of a dataset

df1.tail(3)

      name  age  grade gender
4  Schmidt   52     83      M
5    Polly   36     99      F
6  Pattern    7      7      M

In [7]:
# remove index

df1.reset_index()

   index     name  age  grade gender
0      0     John   22     99      M
1      1    Jacob   33     98      M
2      2   Jingle   44     91      M
3      3   Heimer   45     87      M
4      4  Schmidt   52     83      M
5      5    Polly   36     99      F
6      6  Pattern    7      7      M

In [8]:
df1.reset_index(drop = True)

      name  age  grade gender
0     John   22     99      M
1    Jacob   33     98      M
2   Jingle   44     91      M
3   Heimer   45     87      M
4  Schmidt   52     83      M
5    Polly   36     99      F
6  Pattern    7      7      M

In [10]:
#Find dataframe shape i.e. number of rows and columns in the dataframe

df1.shape

(7, 4)

In [11]:
#print the number of rows


print('number of rows', df1.shape[0])

number of rows 7